{
  "blogPosts": [
      {
      "title": "From barrier to solution: how educators can identify and build their own accessibility tools",
      "url": "https://media-and-learning.eu/subject/artificial-intelligence/from-barrier-to-solution-how-educators-can-identify-and-build-their-own-accessibility-tools/",
      "themes": [],
      "tags": [],
      "summary": "Follow up blog post to a presentation I gave at a Media and Learning Association Webinar in 2025.",
      "publisher": "Media & Learning Association"
    },
    {
      "title": "Accessibility Beyond Borders!",
      "url": "https://matthewdeeprose.github.io/Accessibility-Beyond-Borders.html",
      "themes": [],
      "tags": [],
      "summary": "What did we learn from accessibility leaders at six global Higher Education institutions?",
      "publisher": "matthewdeeprose.github.io"
    },
    {
      "title": "How do we write alternative text for images in education?",
      "url": "https://www.timeshighereducation.com/campus/how-do-we-write-alternative-text-images-education",
      "themes": [],
      "tags": [],
      "summary": "Descriptions of images in online documents help all readers – not just those with vision impairment – to fully understand the photograph, chart or graph and make the information accessible",
      "publisher": "Times Higher Education Campus"
    },
    {
      "title": "Is the secret to achieving Accessibility for All Community Collaboration?",
      "url": "https://www.fenews.co.uk/education/is-the-secret-to-achieving-accessibility-for-all-community-collaboration/",
      "themes": [],
      "tags": [],
      "summary": "Matthew Deeprose believes that established communities play a crucial role in fostering education, awareness, and best practices in accessibility. In this article, he will share valuable insights from his colleagues and peers from universities around the world, explore the transformative power of peer learning, the significance of community in achieving accessibility for all, and the impact of communities in higher education.",
      "publisher": "FE News"
    },
    {
      "title": "A colour matrix to make visual content more accessible",
      "url": "https://www.timeshighereducation.com/campus/colour-matrix-make-visual-content-more-accessible",
      "themes": [],
      "tags": [],
      "summary": "Accessible content is better content. One way to boost accessibility in visual materials is paying attention to colour contrast during the design process. Here’s a tool to make that simpler.",
      "publisher": "Times Higher Education Campus"
    },
    {
      "title": "What one thing can IT staff do to improve accessibility?",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2023/03/22/what-one-thing-can-it-staff-do-to-improve-accessibility/",
      "themes": [],
      "tags": [],
      "summary": "What’s one activity that everyone who works in an information technology related field could do to make a difference to digital accessibility? The answer could be right in front of you as you read this: your keyboard.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "How can we correct captions and create transcripts at the University of Southampton?",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2023/03/17/how-can-we-correct-captions-and-create-transcripts-at-the-university-of-southampton/",
      "themes": [],
      "tags": [],
      "summary": "Captions on videos benefit everyone. It’s important that captions are accurate and follow good practice. Learn how to improve captions using University tools.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "How did we make the University’s Teaching Excellence Framework (TEF) submission more accessible?",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2023/02/24/tef-accessibility/",
      "themes": [],
      "tags": [],
      "summary": "A case study with examples of improving document accessibility. This is based around the work I did on improving the accessibility of the University of Southampton's Teaching Excellence Framework submission.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "Interview with textBOX",
      "url": "https://www.textboxdigital.com/lunchbox-011",
      "themes": [],
      "tags": [],
      "summary": "TextBox are well known for their accessibility work, most recently the ASPIRE awards. Huw Alexander from TextBox invited me to do an interview for their Lunchbox series.",
      "publisher": "textBOX"
    },
    {
      "title": "iSolutions Digital Accessibility Community of Practice: what did we do in 2021 and what was the impact?",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2022/01/17/da_cop_2021_review/",
      "themes": [],
      "tags": [],
      "summary": "The iSolutions Digital Accessibility Community of Practice began in December 2020. It aims to share practices, provide peer support, and raise awareness of digital accessibility within the department. Using results from a survey of community members, in this post I review the past year and looks forward to the year to come.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "Accessibility Allies",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/accessibility-allies/",
      "themes": [],
      "tags": [],
      "summary": "Resources and artefacts shared as part of a presentation about the \"Accessibility Allies Project\" at the University of Southampton.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "Accessibility does not impede agility! Six ways that Digital Accessibility maps to Agile Practices",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2021/09/22/six-ways-that-digital-accessibility-maps-to-agile-practices/",
      "themes": [],
      "tags": [],
      "summary": "A common misconception is that Digital Accessibility slows down and impedes IT development process, making them less agile. In this post we cover six aspects we learned in our Agile training course and how they relate to accessibility.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "Three ways PowerPoint’s \"Design Ideas\" excludes your audience, and how to fix it.",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2021/07/20/design-ideas-three-ways-overview/",
      "themes": [],
      "tags": [],
      "summary": "PowerPoint’s Design Ideas feature helps us create attractive slides quickly. Unfortunately, some of its suggestions do not follow accessibility best practice, creating barriers that may exclude members of your audience. In this blog post we explain three issues and how to fix them.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "How can I use colour accessibly?",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2021/04/04/how-can-i-use-colour-accessibly/",
      "themes": [],
      "tags": [],
      "summary": "A companion article to my presentation,\"Making it simple to ensure the use of colour is both on brand and accessible\".",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "How can I improve the accessibility of my emails?",
      "url": "https://generic.wordpress.soton.ac.uk/digital-learning/2020/11/23/how-can-i-improve-accessibility-of-my-emails/",
      "themes": [],
      "tags": [],
      "summary": "How to check the accessibility of your emails and encourage your colleagues to do the same.",
      "publisher": "The University of Southampton Digital Learning Blog"
    },
    {
      "title": "Guest blog: How to check your brand's colour contrast for accessibility",
      "url": "https://abilitynet.org.uk/news-blogs/guest-blog-how-check-your-brands-colour-contrast-accessibility",
      "themes": [],
      "tags": [],
      "summary": "In this post I share a method both to ensure colour choices are accessible and inline with an institutional brand.",
      "publisher": "Published by AbilityNet"
    }
  ]
}